Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
27283189133]
module.webgui.null_resource.cloudfront-invalidate: Refreshing state... [id=4527469838895437770]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.pgxflow[0].archive_file.binaries_layer has changed
  ~ resource "archive_file" "binaries_layer" {
        id                  = "c4353fcd14488922d6773d38a1bc1ebfc0e2c5fe"
      ~ output_base64sha256 = "QQXe/fDtcF4zpy8EpzoFeGqLfVsAJJLPUQhcg1oa2yE=" -> "dSo3IogmRNxnML9AB/THEU8WKv+wvuT7Ah8BPUXqXJo="
        # (9 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:4fe315e2d07867510687aae5aa4758b113c7ef4c82043c1f91e529536a3110cf727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      - image_id     = "sha256:4fe315e2d07867510687aae5aa4758b113c7ef4c82043c1f91e529536a3110cf" -> null
      - name         = "727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:6e15a69013f79efdaa49977229327197885d87f85ab0d30a1f286a87535c7e91727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      - image_id     = "sha256:6e15a69013f79efdaa49977229327197885d87f85ab0d30a1f286a87535c7e91" -> null
      - name         = "727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-dbsnp"
      ~ last_modified                  = "2025-07-15T02:47:13.000+0000" -> "2025-07-15T02:48:41.000+0000"
      ~ source_code_size               = 1788 -> 1791
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:4fd66c0eaecaffab42fe784cfed5a37b676f764bb215548d22aa323af9a0b8de727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      - image_id     = "sha256:4fd66c0eaecaffab42fe784cfed5a37b676f764bb215548d22aa323af9a0b8de" -> null
      - name         = "727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:26eeeb51095a21677dbb53aa6c6f168ad76ab0bef5bf3d277c61d1c113e8be99727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      - image_id     = "sha256:26eeeb51095a21677dbb53aa6c6f168ad76ab0bef5bf3d277c61d1c113e8be99" -> null
      - name         = "727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_backup_plan.gaspi_backup_plan will be updated in-place
  ~ resource "aws_backup_plan" "gaspi_backup_plan" {
        id       = "357f3780-6d71-4e9a-aa81-59266834cbfe"
        name     = "gaspi_backup_plan"
      ~ tags     = {
          ~ "Environment" = "dev" -> "uat"
            "Owner"       = "gaspi"
        }
      ~ tags_all = {
          ~ "Environment" = "dev" -> "uat"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_backup_vault.gaspi_backup_vault will be updated in-place
  ~ resource "aws_backup_vault" "gaspi_backup_vault" {
        id              = "gaspi_backup_vault"
        name            = "gaspi_backup_vault"
      ~ tags            = {
          ~ "Environment" = "dev" -> "uat"
            "Owner"       = "gaspi"
        }
      ~ tags_all        = {
          ~ "Environment" = "dev" -> "uat"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "admin_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_authenticated will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "gaspi_authenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "gaspi_unauthenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "unauthenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.manager_group_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "manager_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.ses-sns-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ses-sns-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:ap-southeast-3:727260606489:sesDeliveryLogger",
            ]
          + sid       = "AllowSESToPublishToSNS"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "727260606489",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "ses.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cognito.aws_cognito_identity_pool.gaspi_identity_pool will be updated in-place
  ~ resource "aws_cognito_identity_pool" "gaspi_identity_pool" {
        id                               = "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c"
      ~ tags                             = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all                         = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_cognito_user_pool.gaspi_user_pool will be updated in-place
  ~ resource "aws_cognito_user_pool" "gaspi_user_pool" {
        id                         = "ap-southeast-3_sNjfbidkU"
        name                       = "gaspi-users"
      ~ tags                       = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all                   = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)

      - schema {
          - attribute_data_type      = "String" -> null
          - developer_only_attribute = false -> null
          - mutable                  = true -> null
          - name                     = "identity_id" -> null
          - required                 = false -> null

          - string_attribute_constraints {}
        }
      + schema {
          + attribute_data_type      = "Boolean"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "is_medical_director"
          + required                 = false
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "identity_id"
          + required                 = false

          + string_attribute_constraints {
                # (2 unchanged attributes hidden)
            }
        }

        # (9 unchanged blocks hidden)
    }

  # module.cognito.aws_iam_policy.admin_group_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "admin_group_role_policy" {
        id               = "arn:aws:iam::727260606489:policy/gaspi-admin-group-role-policy"
        name             = "gaspi-admin-group-role-policy"
      ~ tags             = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all         = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_policy.manager_group_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "manager_group_role_policy" {
        id               = "arn:aws:iam::727260606489:policy/gaspi-manager-group-role-policy"
        name             = "gaspi-manager-group-role-policy"
      ~ tags             = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all         = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_role.admin_group_role will be updated in-place
  ~ resource "aws_iam_role" "admin_group_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi-admin-group-role"
        name                  = "gaspi-admin-group-role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_role.gaspi_authenticated will be updated in-place
  ~ resource "aws_iam_role" "gaspi_authenticated" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi_authenticated"
        name                  = "gaspi_authenticated"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_iam_role.gaspi_unauthenticated will be updated in-place
  ~ resource "aws_iam_role" "gaspi_unauthenticated" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "unauthenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi_unauthenticated"
        name                  = "gaspi_unauthenticated"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_iam_role.manager_group_role will be updated in-place
  ~ resource "aws_iam_role" "manager_group_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi-manager-group-role"
        name                  = "gaspi-manager-group-role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.cognito.aws_sns_topic.sesDeliveryLogger will be updated in-place
  ~ resource "aws_sns_topic" "sesDeliveryLogger" {
        id                                       = "arn:aws:sns:ap-southeast-3:727260606489:sesDeliveryLogger"
        name                                     = "sesDeliveryLogger"
      ~ tags                                     = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.cognito.aws_sns_topic_policy.sesDeliveryLogger will be updated in-place
  ~ resource "aws_sns_topic_policy" "sesDeliveryLogger" {
        id     = "arn:aws:sns:ap-southeast-3:727260606489:sesDeliveryLogger"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sns:Publish"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "727260606489"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ses.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ap-southeast-3:727260606489:sesDeliveryLogger"
                      - Sid       = "AllowSESToPublishToSNS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.error-catcher.data.aws_iam_policy_document.lambda-notifyOnError will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-notifyOnError" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cloudwatch:DescribeAlarms",
            ]
          + resources = [
              + "arn:aws:cloudwatch:ap-southeast-3:727260606489:alarm:error-catcher-notifyOnError",
            ]
        }
      + statement {
          + actions   = [
              + "events:describeRule",
              + "events:disableRule",
              + "events:enableRule",
            ]
          + resources = [
              + "arn:aws:events:ap-southeast-3:727260606489:rule/error-catcher-notifyOnError-trigger",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::error-catcher-recent-errors-20250707234226378900000001",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::error-catcher-recent-errors-20250707234226378900000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:GetMetricData",
              + "cloudwatch:ListMetrics",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:FilterLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:ap-southeast-3:727260606489:log-group:/aws/lambda/*",
            ]
        }
      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:727260606489:configuration-set/*",
              + "arn:aws:ses:ap-southeast-3:727260606489:identity/*",
            ]
        }
    }

  # module.error-catcher.aws_cloudwatch_event_rule.notifyOnError-trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "notifyOnError-trigger" {
        id                  = "error-catcher-notifyOnError-trigger"
        name                = "error-catcher-notifyOnError-trigger"
      ~ tags                = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all            = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.error-catcher.aws_cloudwatch_metric_alarm.notifyOnError-alarm will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "notifyOnError-alarm" {
        id                                    = "error-catcher-notifyOnError"
      ~ tags                                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (22 unchanged attributes hidden)
    }

  # module.error-catcher.aws_s3_bucket.recent-errors will be updated in-place
  ~ resource "aws_s3_bucket" "recent-errors" {
        id                          = "error-catcher-recent-errors-20250707234226378900000001"
      ~ tags                        = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.error-catcher.aws_sns_topic.notifyOnError will be updated in-place
  ~ resource "aws_sns_topic" "notifyOnError" {
        id                                       = "arn:aws:sns:ap-southeast-3:727260606489:error-catcher-notifyOnError"
        name                                     = "error-catcher-notifyOnError"
      ~ tags                                     = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.pgxflow[0].data.aws_iam_policy_document.ec2_references_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ec2_references_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-references-20250521064131152100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/pgxflow-references",
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-batchStarter will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-batchStarter" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:GetAccountSettings",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:GetMetricStatistics",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-batchSubmit will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-batchSubmit" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:GetItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:SendMessage",
              + "sqs:SendMessageBatch",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-initFlow will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-initFlow" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250521064203402700000004",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/projects/*/project-files/*",
              + "arn:aws:s3:::pgxflow-backend-references-20250521064131152100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/pgxflow-references",
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
            ]
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].aws_api_gateway_deployment.PgxApi must be replaced
+/- resource "aws_api_gateway_deployment" "PgxApi" {
      ~ created_date = "2025-07-07T23:45:10Z" -> (known after apply)
      ~ id           = "044v31" -> (known after apply)
      ~ triggers     = {
          - "redeployment" = "46b707e994db8ec08a5508dcae1d654ef5fd8e49"
        } -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_api_gateway_integration.batch-submit-options will be created
  + resource "aws_api_gateway_integration" "batch-submit-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + region               = "ap-southeast-3"
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = "xka9g7txth"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.pgxflow[0].aws_api_gateway_integration.batch-submit-post will be created
  + resource "aws_api_gateway_integration" "batch-submit-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + rest_api_id             = "xka9g7txth"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration.results-get will be created
  + resource "aws_api_gateway_integration" "results-get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + rest_api_id             = "xka9g7txth"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration.results-options will be created
  + resource "aws_api_gateway_integration" "results-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + region               = "ap-southeast-3"
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = "xka9g7txth"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.pgxflow[0].aws_api_gateway_integration.submit-options will be created
  + resource "aws_api_gateway_integration" "submit-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + region               = "ap-southeast-3"
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = "xka9g7txth"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.pgxflow[0].aws_api_gateway_integration.submit-patch will be created
  + resource "aws_api_gateway_integration" "submit-patch" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PATCH"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + rest_api_id             = "xka9g7txth"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration.submit-post will be created
  + resource "aws_api_gateway_integration" "submit-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + rest_api_id             = "xka9g7txth"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.batch-submit-options will be created
  + resource "aws_api_gateway_integration_response" "batch-submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = "xka9g7txth"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.batch-submit-post will be created
  + resource "aws_api_gateway_integration_response" "batch-submit-post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "xka9g7txth"
      + status_code        = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.results-get will be created
  + resource "aws_api_gateway_integration_response" "results-get" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "xka9g7txth"
      + status_code        = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.results-options will be created
  + resource "aws_api_gateway_integration_response" "results-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,GET'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = "xka9g7txth"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.submit-options will be created
  + resource "aws_api_gateway_integration_response" "submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = "xka9g7txth"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.submit-patch will be created
  + resource "aws_api_gateway_integration_response" "submit-patch" {
      + http_method        = "PATCH"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "xka9g7txth"
      + status_code        = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.submit-post will be created
  + resource "aws_api_gateway_integration_response" "submit-post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "xka9g7txth"
      + status_code        = "200"
    }

  # module.pgxflow[0].aws_api_gateway_method.batch-submit-options will be created
  + resource "aws_api_gateway_method" "batch-submit-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "xka9g7txth"
    }

  # module.pgxflow[0].aws_api_gateway_method.batch-submit-post will be created
  + resource "aws_api_gateway_method" "batch-submit-post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = "nk0u8b"
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "xka9g7txth"
    }

  # module.pgxflow[0].aws_api_gateway_method.results-get will be created
  + resource "aws_api_gateway_method" "results-get" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = "nk0u8b"
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "xka9g7txth"
    }

  # module.pgxflow[0].aws_api_gateway_method.results-options will be created
  + resource "aws_api_gateway_method" "results-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "xka9g7txth"
    }

  # module.pgxflow[0].aws_api_gateway_method.submit-options will be created
  + resource "aws_api_gateway_method" "submit-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "xka9g7txth"
    }

  # module.pgxflow[0].aws_api_gateway_method.submit-patch will be created
  + resource "aws_api_gateway_method" "submit-patch" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = "nk0u8b"
      + http_method      = "PATCH"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "xka9g7txth"
    }

  # module.pgxflow[0].aws_api_gateway_method.submit-post will be created
  + resource "aws_api_gateway_method" "submit-post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = "nk0u8b"
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "xka9g7txth"
    }

  # module.pgxflow[0].aws_api_gateway_method_response.batch-submit-options will be created
  + resource "aws_api_gateway_method_response" "batch-submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "xka9g7txth"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_method_response.batch-submit-post will be created
  + resource "aws_api_gateway_method_response" "batch-submit-post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "xka9g7txth"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_method_response.results-get will be created
  + resource "aws_api_gateway_method_response" "results-get" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "xka9g7txth"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_method_response.results-options will be created
  + resource "aws_api_gateway_method_response" "results-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "xka9g7txth"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_method_response.submit-options will be created
  + resource "aws_api_gateway_method_response" "submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "xka9g7txth"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_method_response.submit-patch will be created
  + resource "aws_api_gateway_method_response" "submit-patch" {
      + http_method         = "PATCH"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "xka9g7txth"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_method_response.submit-post will be created
  + resource "aws_api_gateway_method_response" "submit-post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "xka9g7txth"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_resource.batch-submit will be created
  + resource "aws_api_gateway_resource" "batch-submit" {
      + id          = (known after apply)
      + parent_id   = "p55u3edw3f"
      + path        = (known after apply)
      + path_part   = "batch-submit"
      + region      = "ap-southeast-3"
      + rest_api_id = "xka9g7txth"
    }

  # module.pgxflow[0].aws_api_gateway_resource.results will be created
  + resource "aws_api_gateway_resource" "results" {
      + id          = (known after apply)
      + parent_id   = "p55u3edw3f"
      + path        = (known after apply)
      + path_part   = "results"
      + region      = "ap-southeast-3"
      + rest_api_id = "xka9g7txth"
    }

  # module.pgxflow[0].aws_api_gateway_resource.submit will be created
  + resource "aws_api_gateway_resource" "submit" {
      + id          = (known after apply)
      + parent_id   = "p55u3edw3f"
      + path        = (known after apply)
      + path_part   = "submit"
      + region      = "ap-southeast-3"
      + rest_api_id = "xka9g7txth"
    }

  # module.pgxflow[0].aws_api_gateway_stage.PgxApi will be updated in-place
  ~ resource "aws_api_gateway_stage" "PgxApi" {
      ~ deployment_id         = "044v31" -> (known after apply)
        id                    = "ags-xka9g7txth-prod"
        tags                  = {}
        # (15 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_cloudwatch_event_rule.batch_starter_trigger will be created
  + resource "aws_cloudwatch_event_rule" "batch_starter_trigger" {
      + arn                 = (known after apply)
      + description         = "Trigger for initation of queued batch job submissions."
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "pgxflow-backend-batchStarterTrigger"
      + name_prefix         = (known after apply)
      + region              = "ap-southeast-3"
      + schedule_expression = "rate(2 minutes)"
      + tags_all            = (known after apply)
    }

  # module.pgxflow[0].aws_cloudwatch_event_target.batch_starter_trigger will be created
  + resource "aws_cloudwatch_event_target" "batch_starter_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "ap-southeast-3"
      + rule           = "pgxflow-backend-batchStarterTrigger"
      + target_id      = "lambda-batchStarter"
    }

  # module.pgxflow[0].aws_dynamodb_table.pgxflow_references will be updated in-place
  ~ resource "aws_dynamodb_table" "pgxflow_references" {
        id                          = "pgxflow-references"
        name                        = "pgxflow-references"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].aws_iam_role_policy.ec2_references_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "ec2_references_policy" {
        id          = "pgxflow_backend_ec2_references_instance_role:pgxflow_backend_ec2_references_policy"
        name        = "pgxflow_backend_ec2_references_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-references-20250521064131152100000001/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:727260606489:table/pgxflow-references"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:727260606489:layer:pgxflow_backend_binaries_layer:4" -> (known after apply)
      ~ code_sha256                 = "QQXe/fDtcF4zpy8EpzoFeGqLfVsAJJLPUQhcg1oa2yE=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-15T02:15:10.941+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:727260606489:layer:pgxflow_backend_binaries_layer:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:727260606489:layer:pgxflow_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "QQXe/fDtcF4zpy8EpzoFeGqLfVsAJJLPUQhcg1oa2yE=" -> "dSo3IogmRNxnML9AB/THEU8WKv+wvuT7Ah8BPUXqXJo=" # forces replacement
      ~ source_code_size            = 15153577 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_lambda_permission.batchstarter_invoke_permission will be created
  + resource "aws_lambda_permission" "batchstarter_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-batchStarter"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "CloudwatchBatchStarterAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].aws_lambda_permission.batchsubmit_invoke_permission will be created
  + resource "aws_lambda_permission" "batchsubmit_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-batchSubmit"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:727260606489:xka9g7txth/*/*/batch-submit"
      + statement_id        = "APIBatchSubmitAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].aws_lambda_permission.getresultsurl_invoke_permission will be created
  + resource "aws_lambda_permission" "getresultsurl_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-getResultsURL"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:727260606489:xka9g7txth/*/*/results"
      + statement_id        = "AllowAPIGetResultsURLInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].aws_lambda_permission.initflow_invoke_permission_api will be created
  + resource "aws_lambda_permission" "initflow_invoke_permission_api" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-initFlow"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:727260606489:xka9g7txth/*/*/submit"
      + statement_id        = "AllowAPIInitFlowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].aws_lambda_permission.initflow_invoke_permission_sns will be created
  + resource "aws_lambda_permission" "initflow_invoke_permission_sns" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-initFlow"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowSNSInitFlowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].aws_s3_bucket.lambda-layers-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "lambda-layers-bucket" {
        id                          = "pgxflow-backend-layers-20250521064132794700000002"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].aws_s3_bucket.pgxflow-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "pgxflow-bucket" {
        id                          = "pgxflow-backend-20250521064132931100000003"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].aws_s3_bucket.pgxflow-references will be updated in-place
  ~ resource "aws_s3_bucket" "pgxflow-references" {
        id                          = "pgxflow-backend-references-20250521064131152100000001"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].aws_sns_topic.initFlow will be created
  + resource "aws_sns_topic" "initFlow" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "pgxflow-backend-initFlow"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.pgxflow[0].aws_sns_topic_subscription.initFlow will be created
  + resource "aws_sns_topic_subscription" "initFlow" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.pgxflow[0].aws_sqs_queue.batch_submit_dlq will be created
  + resource "aws_sqs_queue" "batch_submit_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "pgxflow-backend-batchSubmitDLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + region                            = "ap-southeast-3"
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                          = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.pgxflow[0].aws_sqs_queue.batch_submit_queue will be created
  + resource "aws_sqs_queue" "batch_submit_queue" {
      + arn                               = (known 
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.